app/Controllers/KaryawanController.php

    public function save(){
        $arraypost = $this->request->getPost(); // menangkap data post

        // set rules
        $this->validation->setRules($this->setRules);
        // menjalankan validasi
        $isValid = $this->validation->run($arraypost);

        // jika gagal
        if(!$isValid){
            // kembali kelahaman sebelumnya
            return redirect()->back()->withInput();
        }

        // setup insert data
        $data = [
            'nama_karyawan' => $arraypost['nama_karyawan'],
            'no_telepon' => $arraypost['no_telepon'],
            'email' => $arraypost['email'],
            'alamat' => $arraypost['alamat'],
            'username' => $arraypost['username'],
            'password' => $arraypost['password'],
            'role' => $arraypost['role']
        ];

        // dd($data);

        // save data
        $this->ModelKaryawan->save($data);
---
INSERT INTO `karyawan` (`nama_karyawan`, `no_telepon`, `email`, `alamat`, `username`, `password`, `role`) VALUES ('Yudhistira Adimas ', '097123612', 'prakosoadimas032@gmail.com', 'Jl, jaya no 10', 'admin', '123123', 'Admin')