app/Controllers/KaryawanController.php

INSERT INTO `karyawan` (`nama_karyawan`, `no_telepon`, `email`, `alamat`, `username`, `password`, `role`) VALUES ('', '', '', '', '', '', 'Admin')
---
    public function save(){
        $arraypost = $this->request->getPost(); // menangkap data post

        // setup insert data
        $data = [
            'nama_karyawan' => $arraypost['nama_karyawan'],
            'no_telepon' => $arraypost['no_telepon'],
            'email' => $arraypost['email'],
            'alamat' => $arraypost['alamat'],
            'username' => $arraypost['username'],
            'password' => $arraypost['password'],
            'role' => $arraypost['role']
        ];

        // dd($data);

        // save data
        $this->ModelKaryawan->save($data);